### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [6]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
school_data_to_load = "schools_complete.csv"
student_data_to_load = "students_complete.csv"

# Read School and Student Data File and store into Pandas Data Frames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

# Combine the data into a single dataset
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])

In [7]:
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [8]:
total_schools = len(school_data_complete['school_name'])
total_schools

39170

In [9]:
total_students = len(school_data_complete['student_name'])
total_students

39170

In [44]:
budgets = school_data_complete["budget"].unique()
budgets

array([1910635, 1884411, 1056600, 3022020,  917500, 1319574, 1081356,
       3124928,  248087,  585858, 1049400, 2547363, 3094650, 1763916,
       1043130], dtype=int64)

In [45]:
budgets_df = pd.DataFrame(budgets)
budgets_df.head()

         0
0  1910635
1  1884411
2  1056600
3  3022020
4   917500

In [47]:
budgets_df = budgets_df.rename(
    columns={0: "Budget"})
budgets_df.head()

    Budget
0  1910635
1  1884411
2  1056600
3  3022020
4   917500

In [48]:
total_budget = budgets_df.sum()
total_budget

Budget    24649428
dtype: int64

In [10]:
average_math = school_data_complete['math_score'].mean()
average_math

78.98537145774827

In [11]:
average_reading = school_data_complete['reading_score'].mean()
average_reading

81.87784018381414

In [12]:
overall_passing = ((average_math + average_reading)/2)*100
overall_passing

8043.1605820781215

In [49]:
passing_math_df = school_data_complete.loc[school_data_complete['math_score'] >= 70, :]
# passing_math_df.head()

In [16]:
percent_passing_math = (len(passing_math_df['student_name'])/total_students)*100
percent_passing_math

74.9808526933878

In [50]:
passing_reading_df = school_data_complete.loc[school_data_complete['reading_score'] >= 70, :]
# passing_reading_df.head()

In [18]:
percent_passing_reading = (len(passing_reading_df['student_name'])/total_students)*100
percent_passing_reading

85.80546336482001

In [ ]:
# Create a dataframe to hold the above results
results_district_df = pd.Dataframe{("Total Schools" : total_schools,
                                    "Total Students": total_students,
                                    "Total Budget": 
                                   )}

In [17]:
# Sample bins. Feel free to create your own bins.
spending_bins = [0, 585, 615, 645, 675]
group_names = ["<$585", "$585-615", "$615-645", "$645-675"]

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
Spending Ranges (Per Student),,,,,
<$585,83.455399,83.933814,93.460096,96.610877,95.035486
$585-615,83.599686,83.885211,94.230858,95.900287,95.065572
$615-645,79.079225,81.891436,75.668212,86.106569,80.887391
$645-675,76.997210,81.027843,66.164813,81.133951,73.649382

## Scores by School Size

* Perform the same operations as above, based on school size.

In [ ]:
# Sample bins. Feel free to create your own bins.
size_bins = [0, 1000, 2000, 5000]
group_names = ["Small (<1000)", "Medium (1000-2000)", "Large (2000-5000)"]

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
School Size,,,,,
Small (<1000),83.821598,83.929843,93.550225,96.099437,94.824831
Medium (1000-2000),83.374684,83.864438,93.599695,96.790680,95.195187
Large (2000-5000),77.746417,81.344493,69.963361,82.766634,76.364998

## Scores by School Type

* Perform the same operations as above, based on school type.

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
School Type,,,,,
Charter,83.473852,83.896421,93.620830,96.586489,95.103660
District,76.956733,80.966636,66.548453,80.799062,73.673757